# Урок 3. Списки и словари
## домашнее задание   
# # 

**Задача 16:** *Требуется вычислить, сколько раз встречается некоторое
число X в массиве A[1..N]. Пользователь в первой строке вводит
натуральное число N – количество элементов в массиве. В последующих
строках записаны N целых чисел Ai
Последняя строка содержит число X*

##  

Для решения задачи использован метод списков ```count()```  
Ключевой код:
```
print(msg_answer.format(num_to_find, array.count(num_to_find)))
```  
, где  
```msg_answer``` - 'Число {} в этом массиве встречается {} раз'  
```num_to_find``` - вводимое пользователем число Х  
```array``` - также генерируется пользователем  
##
Результат работы программы:
```
Укажите размер массива: 10
Укажите максимальный размер значения в массиве: 5
Сгенерированный массив: [5, 5, 4, 4, 4, 1, 5, 5, 0, 0]
Укажите искомое число: 1
Число 1 в этом массиве встречается 1 раз
```
#

**Задача 18:** Требуется найти в массиве A[1..N] самый близкий по
величине элемент* к заданному числу X. Пользователь в первой строке
вводит натуральное число N – количество элементов в массиве. В
последующих строках записаны N целых чисел Ai
Последняя строка содержит число X*   

##  


Для решения задачи использован метод списков ```count()```  
Ключевой код:
```
print(msg_answer.format(min_difference_finder(array, user_input)))
```  
, где  
```msg_answer``` - 'Следующие числа являются ближайшими к введённому: {}'  
```user_input``` - вводимое пользователем число, соседей которого ищем  
```array``` - также генерируется пользователем   
```min_difference_finder``` - функция:  
```
def min_difference_finder(array, number):
    min_diff = min({abs(i - number) for i in array}) 
    return {i for i in array if abs(i - number) == min_diff} 
```
аргументы функции - массив и введённое пользователем число  
в первой строчке находим минимум из множества всех разниц по модулю между значениями массива и введённого числа  
во второй строчке делаем новое множество, на случай если два числа на одинаковом расстоянии вверх и вниз стоят 
##
Результат работы программы:
```
Укажите размер массива: 10
Укажите максимальный размер значения в массиве: 100
Сгенерированный массив: [19, 6, 40, 19, 70, 78, 77, 66, 97, 15]
Укажите искомое число: 17
Следующие числа являются ближайшими к введённому: {19, 15}

Укажите размер массива: 6 
Укажите максимальный размер значения в массиве: 20
Сгенерированный массив: [20, 13, 3, 9, 7, 16]
Укажите искомое число: 100
Следующие числа являются ближайшими к введённому: {20}
``` 

#


**Задача 20:** *В настольной игре Скрабл (Scrabble) каждая буква имеет определенную
ценность. В случае с английским алфавитом очки распределяются так:  
● A, E, I, O, U, L, N, S, T, R – 1 очко;  
● D, G – 2 очка;  
● B, C, M, P – 3 очка;  
● F, H, V, W, Y – 4 очка;  
● K – 5 очков;  
● J, X – 8 очков;  
● Q, Z – 10 очков.  
А русские буквы оцениваются так:  
● А, В, Е, И, Н, О, Р, С, Т – 1 очко;   
● Д, К, Л, М, П, У – 2 очка;  
● Б, Г, Ё, Ь, Я – 3 очка;  
● Й, Ы – 4 очка;  
● Ж, З, Х, Ц, Ч – 5 очков;  
● Ш, Э, Ю – 8 очков;  
● Ф, Щ, Ъ – 10 очков.  
Напишите программу, которая вычисляет стоимость введенного пользователем слова.
Будем считать, что на вход подается только одно слово, которое содержит либо только
английские, либо только русские буквы.*  

##  

Попробовал унифицировать задачу, у нас есть N словарей, программа автоматически проверяет введённое слово, соотносит его с одним из словарей и выдаёт сумму букв. Если присутствуют буквы из разных словарей, - просьба повторить ввод (это по условию задачи - содержатся буквы только одного словаря)  

словари определяются следующим образом:  
```
dict_rus = {1: {'А', 'В', 'Е', 'И', 'Н', 'О', 'Р', 'С', 'Т'},
            2: {'Д', 'К', 'Л', 'М', 'П', 'У'},
            3: {'Б', 'Г', 'Ё', 'Ь', 'Я'},
            4: {'Й', 'Ы'},
            5: {'Ж', 'З', 'Х', 'Ц', 'Ч'},
            8: {'Ш', 'Э', 'Ю'},
            10:{'Ф', 'Щ', 'Ъ'}}
```
тут ключ - значимость буквы, значение - все соответствующие буквы  
функция старта "игры":    
```
def scrabble(all_dicts):
    user_input = input(msg_inv).upper()
    for current_dict in all_dicts:
        if check_language(user_input, current_dict):
            print(msg_answer.format(sum_letters(user_input, current_dict)))
            return
    print(msg_mixed_word)
```
```all_dict``` - множество словарей выбранных для проведения игры (в нашем случае - ```(dict_rus, dict_eng)```)  

```check_language(user_input, current_dict)``` - булева функция для проверки слова на соответствие словарю:  
```
def check_language(word_to_check, some_dict):
    alpabet = set()
    for item in list(some_dict.values()): alpabet |= item   
    for i in word_to_check: 
        if i not in alpabet: 
            return False
    return True
```
*было желание напрямую работать с элементами значений словаря типа ```for i in some_dict.values():``` что бы не "разворачивать" алфавит, не получилось...*  
```sum_letters``` - функция уже непосредственно для подстчёта суммы букв конкретного слова из конкретного словаря:  
```
def sum_letters(word_to_sum, some_dict):
    word_value = 0
    for letter in word_to_sum:
        for key in some_dict:
            if letter in some_dict[key]:
                word_value += key
                break
    return word_value
```
##
Результат работы программы:
```
Эта программка поможет подсчитать ценность слова в игре Scrubble
Введите слово: 1ноутбук
Слово должно быть одно и состоять или только из букв выбранных словарей (рус, англ)!
Повторим? 1 - да, любой другой ввод - нет: 1

Введите слово: ноут бук
Слово должно быть одно и состоять или только из букв выбранных словарей (рус, англ)!
Повторим? 1 - да, любой другой ввод - нет: 1

Введите слово: ноутбук
Ценность введённого слова составляет 12 очков
Повторим? 1 - да, любой другой ввод - нет: 1

Введите слово: notebook
Ценность введённого слова составляет 14 очков
Повторим? 1 - да, любой другой ввод - нет: qwe
Покеда
``` 