# Задача 24: В фермерском хозяйстве в Карелии выращивают чернику. Она растет на
# круглой грядке, причем кусты высажены только по окружности. Таким образом, у
# каждого куста есть ровно два соседних. Всего на грядке растет N кустов.
# Эти кусты обладают разной урожайностью, поэтому ко времени сбора на них
# выросло различное число ягод – на i-ом кусте выросло ai
#  ягод.
# В этом фермерском хозяйстве внедрена система автоматического сбора черники.
# Эта система состоит из управляющего модуля и нескольких собирающих модулей.
# Собирающий модуль за один заход, находясь непосредственно перед некоторым
# кустом, собирает ягоды с этого куста и с двух соседних с ним.
# Напишите программу для нахождения максимального числа ягод, которое может
# собрать за один заход собирающий модуль, находясь перед некоторым кустом
# заданной во входном файле грядки.


import my_functions as mf

msg_bushes = 'Сколько у нас на грядке кустов? - '
msg_max_berries = 'Какое самое большое количество ягод можно собрать с одного куста? - '
msg_garden_bed = 'Такое количество ягод выросло на каждом кусту:\n{}'
msg_answer = 'Автомат за раз сможет собрать максимум {} ягод'

bushes = mf.input_int(msg_bushes)
max_berries = mf.input_int(msg_max_berries)
garden_bed = mf.generate_random_int_list(bushes, max_berries)
print(msg_garden_bed.format(garden_bed))

triplets = list()
for i in range(bushes):
    triplets.append(garden_bed[i]+garden_bed[i-1]+garden_bed[i-2])

print(msg_answer.format(max(triplets)))