# Знакомство с языком Python (семинары)
## Урок 7. Функции высшего порядка
#

**Задача 34:** *Винни-Пух попросил Вас посмотреть, есть ли в его стихах ритм. Поскольку разобраться в его кричалках не настолько просто, насколько легко он их придумывает, Вам стоит написать программу. Винни-Пух считает, что ритм есть, если число слогов (т.е. число гласных букв) в каждой фразе стихотворения одинаковое. Фраза может состоять из одного слова, если во фразе несколько слов, то они разделяются дефисами. Фразы отделяются друг от друга пробелами. Стихотворение Винни-Пух вбивает в программу с клавиатуры. В ответе напишите “Парам пам-пам”, если с ритмом все в порядке и “Пам парам”, если с ритмом все не в порядке*  
```
Ввод: 
пара-ра-рам рам-пам-папам па-ра-па-дам

Вывод:
Парам пам-пам
```
Исполняющей задачу функцией является функция ```ritm_checker(word_list)```, на вход которой поступает список слов формата ```['пара-ра-рам', 'рам-пам-папам', 'па-ра-па-дам']```. Слова получаем встроенным методом ```split()```.   
### Основная функция:  
```
def ritm_checker(word_list):
    ritms = list()
    for word in word_list:
        counter = 0
        for letter in vowels: counter += word.count(letter)
        ritms.append(counter) 
        if len(ritms) == 1: continue
        if ritms[-1] != ritms[-2]: 
            return False
    return True
```
```vowels = 'аеёиоуыэюя'``` - строка гласных букв  
также есть генератор кричалок Винни-Пуха ```chant_generator()``` и генератор слогов ```syllables_generator(letters)```, но это такой ***код, что лучше не смотреть)) Разбирался с разными рандомами, в итоге много подгонял, что бы кричалки получались более-менее читаемые 
#

**Задача 36:** *Напишите функцию print_operation_table(operation, num_rows=6, num_columns=6), которая принимает в качестве аргумента функцию, вычисляющую элемент по номеру строки и столбца. Аргументы num_rows и num_columns указывают число строк и столбцов таблицы, которые должны быть распечатаны. Нумерация строк и столбцов идет с единицы (подумайте, почему не с нуля). Примечание: бинарной операцией называется любая операция, у которой ровно два аргумента, как, например, у операции умножения.*  
```
Ввод: 
print_operation_table(lambda x, y: x * y)

Вывод: 
 1 2 3 4 5 6
 2 4 6 8 10 12
 3 6 9 12 15 18
 4 8 12 16 20 24
 5 10 15 20 25 30
 6 12 18 24 30 36 
```
*По условию, функция должна сразу печатать таблицу, но ощущается это абсолютно не правильно..*

### Ключевые функции

```start()``` - вызывает ```print_table(input_conditions())```  

```input_conditions()``` - тут весь ввод от пользователя - число строк, число столбцов, а также бинарная оперция. При успешно введённых значениях она вызывает функцию ```create_operation_table(fn, rows=6, cols=6)```, которая создаёт и возвращает соответствующий список списков:
```
def create_operation_table(fn, rows=6, cols=6):
    if not 1 < rows < 21: rows = 6 
    if not 1 < cols < 21: cols = 6 # защита от превышающих
    return [[fn(i+1,j+1) for j in range(cols)] for i in range(rows)]
```
тут я поленился в условии ввода ставить ограничения на размер таблицы, поэтому вот  
Матрица уже вычисленных значений (список списков) поступают на ```print_table(table)```:
```
def print_table(table):
    print()
    for row in table:
        for num in row: 
            print('{:^4}'.format(num), end=' ')
        print()
    print()
```
операции хранятся в соответствующем словаре
``` 
oper_shop = {'+': lambda x, y: x+y,
             '-': lambda x, y: x-y,
             '*': lambda x, y: x*y,
             '/': lambda x, y: x/y,
             '//': lambda x, y: x//y,
             '%': lambda x, y: x%y,
             '**': lambda x, y: x**y}
```